// ---------- LANGUAGE DATA ----------
const translations = {
    "en": {
        "nav_manifesto": "What Neurobit do?",
        "nav_process": "Process",
        "nav_apply": "joinUS",
        "nav_playbook": "Admission Requirements",
        "nav_learning_paths": "Learning Paths",
        "logo_text": "Neurobit",
        "hero_section_title": "NEUROBIT",
        "hero_ready": "Are you ready for the future?",
        "manifesto_title": "What Neurobit do?",
        "requirements_title": "requierements",
        "process_title": "Your development journey",
        "apply_title": "apply and join us",
        "partners_title": "Companies we work with",
        "testimonials_title": "User comments",
        "apply_p": "Participation in the introductory session is free of charge.<br/>In this session, held with the presence of Neurobit’s core team, participants will gain a comprehensive understanding of the program’s educational structure and its key objectives.",
        "join_btn": "Joint Now",
        "footer_copy": "© 2025 – All rights marshmallow‑reserved.",
        "footer_made": "Crafted with ❤️ for Iranian youth",
        "process_step1": "<span style='color: var(--accent);'>1</span>-choose the technical path",
        "process_step2": "<span style='color: var(--accent);'>2</span>-Complete the educational steps of your chosen path.",
        "process_step3": "<span style='color: var(--accent);'>3</span>-Start of the practical internship phase",
        "process_p1": "choose a technical path from the following branches:",
        "process_p2": ` 
        Front-end web development
          <svg xmlns="http://www.w3.org/2000/svg" style='width:1.5rem;height:1.5rem;' viewBox="0 0 24 24" fill="#1dae4b"><path d="M12 18.1778L7.38083 16.9222L7.0517 13.3778H9.32156L9.48045 15.2222L12 15.8889L14.5195 15.2222L14.7806 12.3556H6.96091L6.32535 5.67778H17.6747L17.4477 7.88889H8.82219L9.02648 10.1444H17.2434L16.6192 16.9222L12 18.1778ZM3 2H21L19.377 20L12 22L4.62295 20L3 2ZM5.18844 4L6.48986 18.4339L12 19.9278L17.5101 18.4339L18.8116 4H5.18844Z"></path></svg>
          , back-end web development
          <svg xmlns="http://www.w3.org/2000/svg" style='width:1.5rem;height:1.5rem;' viewBox="0 0 24 24" fill="#1dae4b"><path d="M5 12.5C5 12.8134 5.46101 13.3584 6.53047 13.8931C7.91405 14.5849 9.87677 15 12 15C14.1232 15 16.0859 14.5849 17.4695 13.8931C18.539 13.3584 19 12.8134 19 12.5V10.3287C17.35 11.3482 14.8273 12 12 12C9.17273 12 6.64996 11.3482 5 10.3287V12.5ZM19 15.3287C17.35 16.3482 14.8273 17 12 17C9.17273 17 6.64996 16.3482 5 15.3287V17.5C5 17.8134 5.46101 18.3584 6.53047 18.8931C7.91405 19.5849 9.87677 20 12 20C14.1232 20 16.0859 19.5849 17.4695 18.8931C18.539 18.3584 19 17.8134 19 17.5V15.3287ZM3 17.5V7.5C3 5.01472 7.02944 3 12 3C16.9706 3 21 5.01472 21 7.5V17.5C21 19.9853 16.9706 22 12 22C7.02944 22 3 19.9853 3 17.5ZM12 10C14.1232 10 16.0859 9.58492 17.4695 8.89313C18.539 8.3584 19 7.81342 19 7.5C19 7.18658 18.539 6.6416 17.4695 6.10687C16.0859 5.41508 14.1232 5 12 5C9.87677 5 7.91405 5.41508 6.53047 6.10687C5.46101 6.6416 5 7.18658 5 7.5C5 7.81342 5.46101 8.3584 6.53047 8.89313C7.91405 9.58492 9.87677 10 12 10Z"></path></svg>
          , artificial intelligence
          <svg xmlns='http://www.w3.org/2000/svg' style='width:1.5rem;height:1.5rem;' viewBox='0 0 24 24' fill='#1dae4b'><path d='M20.5624 10.1875C20.8124 9.5 20.8749 8.8125 20.8124 8.125C20.7499 7.4375 20.4999 6.75 20.1874 6.125C19.6249 5.1875 18.8124 4.4375 17.8749 4C16.8749 3.5625 15.8124 3.4375 14.7499 3.6875C14.2499 3.1875 13.6874 2.75 13.0624 2.4375C12.4374 2.125 11.6874 2 10.9999 2C9.9374 2 8.8749 2.3125 7.9999 2.9375C7.1249 3.5625 6.4999 4.4375 6.1874 5.4375C5.4374 5.625 4.8124 5.9375 4.1874 6.3125C3.6249 6.75 3.1874 7.3125 2.8124 7.875C2.24991 8.8125 2.06241 9.875 2.18741 10.9375C2.31241 12 2.7499 13 3.4374 13.8125C3.1874 14.5 3.1249 15.1875 3.1874 15.875C3.2499 16.5625 3.4999 17.25 3.8124 17.875C4.3749 18.8125 5.1874 19.5625 6.1249 20C7.1249 20.4375 8.1874 20.5625 9.2499 20.3125C9.7499 20.8125 10.3124 21.25 10.9374 21.5625C11.5624 21.875 12.3124 22 12.9999 22C14.0624 22 15.1249 21.6875 15.9999 21.0625C16.8749 20.4375 17.4999 19.5625 17.8124 18.5625C18.4999 18.4375 19.1874 18.125 19.7499 17.6875C20.3124 17.25 20.8124 16.75 21.1249 16.125C21.6874 15.1875 21.8749 14.125 21.7499 13.0625C21.6249 12 21.2499 11 20.5624 10.1875ZM13.0624 20.6875C12.0624 20.6875 11.3124 20.375 10.6249 19.8125C10.6249 19.8125 10.6874 19.75 10.7499 19.75L14.7499 17.4375C14.8749 17.375 14.9374 17.3125 14.9999 17.1875C15.0624 17.0625 15.0624 17 15.0624 16.875V11.25L16.7499 12.25V16.875C16.8124 19.0625 15.0624 20.6875 13.0624 20.6875ZM4.9999 17.25C4.5624 16.5 4.3749 15.625 4.5624 14.75C4.5624 14.75 4.6249 14.8125 4.6874 14.8125L8.6874 17.125C8.8124 17.1875 8.8749 17.1875 8.9999 17.1875C9.1249 17.1875 9.2499 17.1875 9.3124 17.125L14.1874 14.3125V16.25L10.1249 18.625C9.2499 19.125 8.2499 19.25 7.3124 19C6.3124 18.75 5.4999 18.125 4.9999 17.25ZM3.9374 8.5625C4.3749 7.8125 5.0624 7.25 5.8749 6.9375V7.0625V11.6875C5.8749 11.8125 5.8749 11.9375 5.9374 12C5.9999 12.125 6.0624 12.1875 6.1874 12.25L11.0624 15.0625L9.3749 16.0625L5.3749 13.75C4.4999 13.25 3.8749 12.4375 3.6249 11.5C3.3749 10.5625 3.4374 9.4375 3.9374 8.5625ZM17.7499 11.75L12.8749 8.9375L14.5624 7.9375L18.5624 10.25C19.1874 10.625 19.6874 11.125 19.9999 11.75C20.3124 12.375 20.4999 13.0625 20.4374 13.8125C20.3749 14.5 20.1249 15.1875 19.6874 15.75C19.2499 16.3125 18.6874 16.75 17.9999 17V12.25C17.9999 12.125 17.9999 12 17.9374 11.9375C17.9374 11.9375 17.8749 11.8125 17.7499 11.75ZM19.4374 9.25C19.4374 9.25 19.3749 9.1875 19.3124 9.1875L15.3124 6.875C15.1874 6.8125 15.1249 6.8125 14.9999 6.8125C14.8749 6.8125 14.7499 6.8125 14.6874 6.875L9.8124 9.6875V7.75L13.8749 5.375C14.4999 5 15.1874 4.875 15.9374 4.875C16.6249 4.875 17.3124 5.125 17.9374 5.5625C18.4999 6 18.9999 6.5625 19.2499 7.1875C19.4999 7.8125 19.5624 8.5625 19.4374 9.25ZM8.9374 12.75L7.2499 11.75V7.0625C7.2499 6.375 7.4374 5.625 7.8124 5.0625C8.1874 4.4375 8.7499 4 9.3749 3.6875C9.9999 3.375 10.7499 3.25 11.4374 3.375C12.1249 3.4375 12.8124 3.75 13.3749 4.1875C13.3749 4.1875 13.3124 4.25 13.2499 4.25L9.2499 6.5625C9.1249 6.625 9.0624 6.6875 8.9999 6.8125C8.9374 6.9375 8.9374 7 8.9374 7.125V12.75ZM9.8124 10.75L11.9999 9.5L14.1874 10.75V13.25L11.9999 14.5L9.8124 13.25V10.75Z'></path></svg>
          , Graphic design
          <svg xmlns="http://www.w3.org/2000/svg" style='width:1.5rem;height:1.5rem;' viewBox="0 0 24 24" fill="#1dae4b"><path d="M4.7134 7.12811L4.46682 7.69379C4.28637 8.10792 3.71357 8.10792 3.53312 7.69379L3.28656 7.12811C2.84706 6.11947 2.05545 5.31641 1.06767 4.87708L0.308047 4.53922C-0.102682 4.35653 -0.102682 3.75881 0.308047 3.57612L1.0252 3.25714C2.03838 2.80651 2.84417 1.97373 3.27612 0.930828L3.52932 0.319534C3.70578 -0.106511 4.29417 -0.106511 4.47063 0.319534L4.72382 0.930828C5.15577 1.97373 5.96158 2.80651 6.9748 3.25714L7.69188 3.57612C8.10271 3.75881 8.10271 4.35653 7.69188 4.53922L6.93228 4.87708C5.94451 5.31641 5.15288 6.11947 4.7134 7.12811ZM6.33421 15.8154C6.51032 15.233 6.7072 14.6562 6.93912 14.0327C8.99484 8.50636 12.4197 5.08172 18.0129 4.21479C17.5 5.35838 17.0151 6.15301 16.5858 6.58237C16.2521 6.91603 15.9185 7.24993 15.5848 7.58407L14.1721 8.99878L15.6279 10.4535C14.4976 12.5384 12.2652 14.1979 9.75193 14.512C8.43544 14.6766 7.29345 15.1188 6.33421 15.8154ZM18 9.99658L17 8.99728C17.3331 8.66372 17.6662 8.33039 18.0027 7.99391C19.0018 6.99303 20.0009 4.99392 21 1.99658C6.31105 1.99658 4.08854 15.422 3.06361 21.6132C3.0419 21.7443 3.02074 21.8722 3 21.9966H4.99824C5.66421 18.6635 7.33146 16.8301 10 16.4966C14 15.9966 17 12.9966 18 9.99658Z"></path></svg>
          game development
          <svg xmlns="http://www.w3.org/2000/svg" style='width:1.5rem;height:1.5rem;' viewBox="0 0 24 24" fill="#1dae4b"><path d="M17 4C20.3137 4 23 6.68629 23 10V14C23 17.3137 20.3137 20 17 20H7C3.68629 20 1 17.3137 1 14V10C1 6.68629 3.68629 4 7 4H17ZM17 6H7C4.8578 6 3.10892 7.68397 3.0049 9.80036L3 10V14C3 16.1422 4.68397 17.8911 6.80036 17.9951L7 18H17C19.1422 18 20.8911 16.316 20.9951 14.1996L21 14V10C21 7.8578 19.316 6.10892 17.1996 6.0049L17 6ZM10 9V11H12V13H9.999L10 15H8L7.999 13H6V11H8V9H10ZM18 13V15H16V13H18ZM16 9V11H14V9H16Z"></path></svg>`,
        "process_p3": "Each learning path consists of several steps, and in each step, learners are taught not only technical skills but also soft skills such as:",
        "process_p4": "mental development, communication enhancement, personal growth, and cognitive skill improvement.",
        "process_p5": "In the practical internship stage, after successfully completing all study phases and related presentations, the intern will begin working on real projects and teams. This stage includes the following actions:",
        "process_p6": "Joining the dedicated Neurobit career-opportunity channel to be introduced and connected to collaborating projects or teams.",
        "process_p7": "Starting practical collaboration with Neurobit’s partner teams and companies based on personal profile, expertise, and performance achieved during the study phase.",
        "manifesto_p1": "The “Neurobit” training program is an ultra-learning educational initiative and a focused, comprehensive pathway for cultivating and empowering future specialists in computer science and software engineering, designed to fully prepare learners for a successful entry into the real-world job market.",
        "manifesto_p2": "This program not only provides trainees with advanced, practical technical skills, but also equips them with valuable business and communication abilities so they can maintain a creative, dynamic, and impactful presence in professional environments.",
        "manifesto_p3": "Graduates of this course can work effectively and with confidence both on software development teams at large, well-known companies and within innovative, agile startups.",
        "manifesto_p4": "Moreover, learners can leverage the skills and knowledge acquired through this program to independently and self-directedly pursue their own career paths or personal business ventures.",
        "manifesto_p5": "This flexibility enables them to advance toward their professional and personal goals and secure a distinguished place in the world of technology.",
        "requirements_p1": "This course is offered to teenagers and young adults aged 15 and above who are interested in software engineering and technology.",
        "requirements_p2": "Upon completion, participants can work in remote software teams and, if they wish, in-person.",
        "requirements_p3": "Motivation and perseverance are more important than academic background, which is not a prerequisite.",
        "requirements_p4": "Access to a suitable computer for coding, with a webcam and sufficient internet speed for online sessions, is required.",
        "requirements_p5": "Because much of the course material is in English, a basic proficiency in reading, listening, and comprehension of the language is necessary.",

        /* Testimonials */
        "testimonial_1": "Neurobit transformed my understanding of AI and gave me the confidence to join a cutting‑edge startup.",
        "testimonial_2": "The mix of technical depth and soft‑skill mentoring is unmatched. I landed my first front‑end job two weeks after graduation.",
        "testimonial_3": "Neurobit’s internship phase put me straight onto real projects—now I’m leading a small team at a health‑tech scale‑up.",
        "role_ai_engineer": "AI Engineer @ Medrick",
        "role_frontend_dev": "Front‑end Dev @ Digikala",
        "role_product_designer": "Product Designer @ Jabama",

        /* Team */
        "team_title": "Meet the Core Team",
        "role_ceo": "CEO",
        "role_cbo": "CBO",
        "role_cto": "CTO",
        "role_name_ceo": "CEO",
        "role_name_cbo": "CBO",
        "role_name_cto": "CTO",

        "ethics_title": "Our Code of Ethics",
        "ethics_intro": "We believe every learner deserves a safe, inclusive, and inspiring space to grow. Here’s how we keep Neurobit a worry‑free environment for teens and young adults.",
        "ethics_point1": "🛡️ Certified mentors: All instructors pass background checks and complete youth‑protection training.",
        "ethics_point2": "🤝 Zero‑tolerance policy toward bullying, harassment, or discrimination of any kind.",
        "ethics_point3": "⏱️ Live sessions are always recorded and available for parents on demand.",
        "ethics_point4": "🔒 Private data stays private — we never share student information with third parties.",
        "ethics_point5": "📞 Dedicated parent hotline and monthly progress reports.",


    },
    "fa": {
        "nav_manifesto": "نوروبیت چیست؟",
        "nav_process": "فرآیند رشد",
        "nav_apply": "پیوستن به برنامه",
        "nav_playbook": "شرایط پذیرش",
        "nav_learning_paths": "مسیرهای یادگیری",
        "logo_text": "نوروبیت",
        "hero_section_title": "نوروبیت",
        "hero_ready": "برای آینده اماده اید؟",
        "manifesto_title": "برنامه نوروبیت چیست؟",
        "requirements_title": "شرایط ورود به برنامه",
        "process_title": "مسیر رشد شما در نوروبیت",
        "apply_title": "همین الان به ما بپیوندید",
        "partners_title": "شرکت های همکار",
        "testimonials_title": "نطرات کاربران",
        "apply_p": "شرکت در جلسه آشنایی اولیه اولیه رایگان است.در این جلسه که با حضور تیم اصلی نوروبیت برگزار می‌شود، شرکت‌کنندگان با ساختار آموزشی برنامه و اهداف کلیدی آن به‌طور کامل آشنا خواهند شد.",
        "join_btn": "درخواست شرکت در جلسه آشنایی",
        "footer_copy": "© ۲۰۲۵ – تمامی حقوق برای نوروبیت محفوظ است.",
        "footer_made": "ساخته شده با ❤️ برای جوانان ایران",
        "process_step1": "<span style='color:var(--accent);'>۱-</span> یک مسیر تکنیکال انتخاب کنید",
        "process_step2": "<span style='color:var(--accent);'>۲-</span> گام های آموزشی مسیر منتخب خود را طی کنید",
        "process_step3": "<span style='color:var(--accent);'>۳-</span> شروع مرحله کارآموزی عملی",
        "process_p1": "یک مسیر فنی از شاخه‌های زیر انتخاب کنید:",
        "process_p2": ` 
        توسعه وب فرانت‌اند
          <svg xmlns="http://www.w3.org/2000/svg" style='width:1.5rem;height:1.5rem;' viewBox="0 0 24 24" fill="#1dae4b"><path d="M12 18.1778L7.38083 16.9222L7.0517 13.3778H9.32156L9.48045 15.2222L12 15.8889L14.5195 15.2222L14.7806 12.3556H6.96091L6.32535 5.67778H17.6747L17.4477 7.88889H8.82219L9.02648 10.1444H17.2434L16.6192 16.9222L12 18.1778ZM3 2H21L19.377 20L12 22L4.62295 20L3 2ZM5.18844 4L6.48986 18.4339L12 19.9278L17.5101 18.4339L18.8116 4H5.18844Z"></path></svg>
          , توسعه وب بک‌اند
          <svg xmlns="http://www.w3.org/2000/svg" style='width:1.5rem;height:1.5rem;' viewBox="0 0 24 24" fill="#1dae4b"><path d="M5 12.5C5 12.8134 5.46101 13.3584 6.53047 13.8931C7.91405 14.5849 9.87677 15 12 15C14.1232 15 16.0859 14.5849 17.4695 13.8931C18.539 13.3584 19 12.8134 19 12.5V10.3287C17.35 11.3482 14.8273 12 12 12C9.17273 12 6.64996 11.3482 5 10.3287V12.5ZM19 15.3287C17.35 16.3482 14.8273 17 12 17C9.17273 17 6.64996 16.3482 5 15.3287V17.5C5 17.8134 5.46101 18.3584 6.53047 18.8931C7.91405 19.5849 9.87677 20 12 20C14.1232 20 16.0859 19.5849 17.4695 18.8931C18.539 18.3584 19 17.8134 19 17.5V15.3287ZM3 17.5V7.5C3 5.01472 7.02944 3 12 3C16.9706 3 21 5.01472 21 7.5V17.5C21 19.9853 16.9706 22 12 22C7.02944 22 3 19.9853 3 17.5ZM12 10C14.1232 10 16.0859 9.58492 17.4695 8.89313C18.539 8.3584 19 7.81342 19 7.5C19 7.18658 18.539 6.6416 17.4695 6.10687C16.0859 5.41508 14.1232 5 12 5C9.87677 5 7.91405 5.41508 6.53047 6.10687C5.46101 6.6416 5 7.18658 5 7.5C5 7.81342 5.46101 8.3584 6.53047 8.89313C7.91405 9.58492 9.87677 10 12 10Z"></path></svg>
          , هوش مصنوعی
          <svg xmlns='http://www.w3.org/2000/svg' style='width:1.5rem;height:1.5rem;' viewBox='0 0 24 24' fill='#1dae4b'><path d='M20.5624 10.1875C20.8124 9.5 20.8749 8.8125 20.8124 8.125C20.7499 7.4375 20.4999 6.75 20.1874 6.125C19.6249 5.1875 18.8124 4.4375 17.8749 4C16.8749 3.5625 15.8124 3.4375 14.7499 3.6875C14.2499 3.1875 13.6874 2.75 13.0624 2.4375C12.4374 2.125 11.6874 2 10.9999 2C9.9374 2 8.8749 2.3125 7.9999 2.9375C7.1249 3.5625 6.4999 4.4375 6.1874 5.4375C5.4374 5.625 4.8124 5.9375 4.1874 6.3125C3.6249 6.75 3.1874 7.3125 2.8124 7.875C2.24991 8.8125 2.06241 9.875 2.18741 10.9375C2.31241 12 2.7499 13 3.4374 13.8125C3.1874 14.5 3.1249 15.1875 3.1874 15.875C3.2499 16.5625 3.4999 17.25 3.8124 17.875C4.3749 18.8125 5.1874 19.5625 6.1249 20C7.1249 20.4375 8.1874 20.5625 9.2499 20.3125C9.7499 20.8125 10.3124 21.25 10.9374 21.5625C11.5624 21.875 12.3124 22 12.9999 22C14.0624 22 15.1249 21.6875 15.9999 21.0625C16.8749 20.4375 17.4999 19.5625 17.8124 18.5625C18.4999 18.4375 19.1874 18.125 19.7499 17.6875C20.3124 17.25 20.8124 16.75 21.1249 16.125C21.6874 15.1875 21.8749 14.125 21.7499 13.0625C21.6249 12 21.2499 11 20.5624 10.1875ZM13.0624 20.6875C12.0624 20.6875 11.3124 20.375 10.6249 19.8125C10.6249 19.8125 10.6874 19.75 10.7499 19.75L14.7499 17.4375C14.8749 17.375 14.9374 17.3125 14.9999 17.1875C15.0624 17.0625 15.0624 17 15.0624 16.875V11.25L16.7499 12.25V16.875C16.8124 19.0625 15.0624 20.6875 13.0624 20.6875ZM4.9999 17.25C4.5624 16.5 4.3749 15.625 4.5624 14.75C4.5624 14.75 4.6249 14.8125 4.6874 14.8125L8.6874 17.125C8.8124 17.1875 8.8749 17.1875 8.9999 17.1875C9.1249 17.1875 9.2499 17.1875 9.3124 17.125L14.1874 14.3125V16.25L10.1249 18.625C9.2499 19.125 8.2499 19.25 7.3124 19C6.3124 18.75 5.4999 18.125 4.9999 17.25ZM3.9374 8.5625C4.3749 7.8125 5.0624 7.25 5.8749 6.9375V7.0625V11.6875C5.8749 11.8125 5.8749 11.9375 5.9374 12C5.9999 12.125 6.0624 12.1875 6.1874 12.25L11.0624 15.0625L9.3749 16.0625L5.3749 13.75C4.4999 13.25 3.8749 12.4375 3.6249 11.5C3.3749 10.5625 3.4374 9.4375 3.9374 8.5625ZM17.7499 11.75L12.8749 8.9375L14.5624 7.9375L18.5624 10.25C19.1874 10.625 19.6874 11.125 19.9999 11.75C20.3124 12.375 20.4999 13.0625 20.4374 13.8125C20.3749 14.5 20.1249 15.1875 19.6874 15.75C19.2499 16.3125 18.6874 16.75 17.9999 17V12.25C17.9999 12.125 17.9999 12 17.9374 11.9375C17.9374 11.9375 17.8749 11.8125 17.7499 11.75ZM19.4374 9.25C19.4374 9.25 19.3749 9.1875 19.3124 9.1875L15.3124 6.875C15.1874 6.8125 15.1249 6.8125 14.9999 6.8125C14.8749 6.8125 14.7499 6.8125 14.6874 6.875L9.8124 9.6875V7.75L13.8749 5.375C14.4999 5 15.1874 4.875 15.9374 4.875C16.6249 4.875 17.3124 5.125 17.9374 5.5625C18.4999 6 18.9999 6.5625 19.2499 7.1875C19.4999 7.8125 19.5624 8.5625 19.4374 9.25ZM8.9374 12.75L7.2499 11.75V7.0625C7.2499 6.375 7.4374 5.625 7.8124 5.0625C8.1874 4.4375 8.7499 4 9.3749 3.6875C9.9999 3.375 10.7499 3.25 11.4374 3.375C12.1249 3.4375 12.8124 3.75 13.3749 4.1875C13.3749 4.1875 13.3124 4.25 13.2499 4.25L9.2499 6.5625C9.1249 6.625 9.0624 6.6875 8.9999 6.8125C8.9374 6.9375 8.9374 7 8.9374 7.125V12.75ZM9.8124 10.75L11.9999 9.5L14.1874 10.75V13.25L11.9999 14.5L9.8124 13.25V10.75Z'></path></svg>
          , طراحی گرافیک
          <svg xmlns="http://www.w3.org/2000/svg" style='width:1.5rem;height:1.5rem;' viewBox="0 0 24 24" fill="#1dae4b"><path d="M4.7134 7.12811L4.46682 7.69379C4.28637 8.10792 3.71357 8.10792 3.53312 7.69379L3.28656 7.12811C2.84706 6.11947 2.05545 5.31641 1.06767 4.87708L0.308047 4.53922C-0.102682 4.35653 -0.102682 3.75881 0.308047 3.57612L1.0252 3.25714C2.03838 2.80651 2.84417 1.97373 3.27612 0.930828L3.52932 0.319534C3.70578 -0.106511 4.29417 -0.106511 4.47063 0.319534L4.72382 0.930828C5.15577 1.97373 5.96158 2.80651 6.9748 3.25714L7.69188 3.57612C8.10271 3.75881 8.10271 4.35653 7.69188 4.53922L6.93228 4.87708C5.94451 5.31641 5.15288 6.11947 4.7134 7.12811ZM6.33421 15.8154C6.51032 15.233 6.7072 14.6562 6.93912 14.0327C8.99484 8.50636 12.4197 5.08172 18.0129 4.21479C17.5 5.35838 17.0151 6.15301 16.5858 6.58237C16.2521 6.91603 15.9185 7.24993 15.5848 7.58407L14.1721 8.99878L15.6279 10.4535C14.4976 12.5384 12.2652 14.1979 9.75193 14.512C8.43544 14.6766 7.29345 15.1188 6.33421 15.8154ZM18 9.99658L17 8.99728C17.3331 8.66372 17.6662 8.33039 18.0027 7.99391C19.0018 6.99303 20.0009 4.99392 21 1.99658C6.31105 1.99658 4.08854 15.422 3.06361 21.6132C3.0419 21.7443 3.02074 21.8722 3 21.9966H4.99824C5.66421 18.6635 7.33146 16.8301 10 16.4966C14 15.9966 17 12.9966 18 9.99658Z"></path></svg>
          , بازی سازی
          <svg xmlns="http://www.w3.org/2000/svg" style='width:1.5rem;height:1.5rem;' viewBox="0 0 24 24" fill="#1dae4b"><path d="M17 4C20.3137 4 23 6.68629 23 10V14C23 17.3137 20.3137 20 17 20H7C3.68629 20 1 17.3137 1 14V10C1 6.68629 3.68629 4 7 4H17ZM17 6H7C4.8578 6 3.10892 7.68397 3.0049 9.80036L3 10V14C3 16.1422 4.68397 17.8911 6.80036 17.9951L7 18H17C19.1422 18 20.8911 16.316 20.9951 14.1996L21 14V10C21 7.8578 19.316 6.10892 17.1996 6.0049L17 6ZM10 9V11H12V13H9.999L10 15H8L7.999 13H6V11H8V9H10ZM18 13V15H16V13H18ZM16 9V11H14V9H16Z"></path></svg>`,
        "process_p3": "هر مسیر آموزشی از چند قدم تشکیل شده است که در هر قدم، علاوه بر مهارت‌های فنی (تکنیکال)، مهارت‌های نرم مانند:",
        "process_p4": "توسعه ذهن، تقویت مهارت‌های ارتباطی، رشد و توسعه فردی، و ارتقای مهارت‌های شناختی نیز آموزش داده می‌شود.",
        "process_p5": "در مرحله کارآموزی عملی، اینترن پس از تکمیل موفقیت‌آمیز تمامی مراحل مطالعاتی و ارائه‌های مرتبط، فعالیت خود را در پروژه‌ها و تیم‌های واقعی آغاز خواهد کرد. این مرحله شامل اقدامات زیر است:",
        "process_p6": "پیوستن اینترن به کانال ویژه‌ی فرصت‌های شغلی نوروبیت جهت معرفی و اتصال به پروژه‌ها یا تیم‌های همکار",
        "process_p7": "آغاز همکاری عملی با تیم‌ها و شرکت‌های همکار نوروبیت بر اساس پروفایل شخصی، تخصص‌ها، و عملکرد کسب‌شده در فاز مطالعاتی",
        "manifesto_p1": " برنامه آموزشی «نوروبیت» برنامه‌ای آموزشی از نوع فرایادگیری (ultra learning) و یک مسیر هدفمند و کامل برای تربیت و توانمندسازی متخصصان آینده در زمینه علوم کامپیوتر و مهندسی نرم‌افزار است که به‌گونه‌ای طراحی شده تا فراگیران را به‌طور کامل برای ورود موفق به بازار کار واقعی آماده کند.",
        "manifesto_p2": "این برنامه نه‌تنها مهارت‌های فنی پیشرفته و کاربردی را به کارآموزان ارائه می‌دهد، بلکه آنان را با مهارت‌های ارزشمند کسب‌وکاری و ارتباطی نیز مجهز می‌کند تا بتوانند حضوری خلاق، پویا و تأثیرگذار در محیط‌های کاری داشته باشند.",
        "manifesto_p3": "فارغ‌التحصیلان این دوره می‌توانند به‌طور مؤثر و با اعتمادبه‌نفس، هم در تیم‌های توسعه نرم‌افزارِ شرکت‌های بزرگ و شناخته‌شده، و هم در استارتاپ‌های نوآورانه و چابک مشغول به فعالیت شوند.",
        "manifesto_p4": "علاوه بر این، فراگیران حتی می‌توانند با تکیه بر توانمندی‌ها و دانشی که از این برنامه کسب می‌کنند، به‌صورت مستقل و خودمحور نیز مسیر شغلی یا کسب‌وکار شخصی خود را دنبال کنند.",
        "manifesto_p5": "این انعطاف‌پذیری به آن‌ها امکان می‌دهد تا در راستای اهداف حرفه‌ای و فردی خویش پیشرفت نمایند و جایگاه ویژه‌ای در دنیای فناوری به‌دست آورند.",
        "requirements_p1": "این دوره برای نوجوانان و جوانان ۱۵ سال به بالا که به مهندسی نرم‌افزار و تکنولوژی علاقه دارند ارائه می‌شود.",
        "requirements_p2": "پس از پایان دوره، شرکت‌کنندگان می‌توانند در تیم‌های نرم‌افزاری دورکار و در صورت تمایل به شکل حضوری مشغول به کار شوند.",
        "requirements_p3": "برای حضور در برنامه، انگیزه و پشتکار بیش از هر مؤلفه‌ای اهمیت دارد و داشتن سابقه تحصیلی پیش‌نیاز نیست.",
        "requirements_p4": "دسترسی به یک رایانه‌ی مناسب برای کدنویسی همراه با وب‌کم و اینترنت با سرعت کافی برای بهره‌برداری از جلسات آنلاین ضروری است.",
        "requirements_p5": "از آن‌جا که بخش زیادی از منابع آموزشی به زبان انگلیسی است، تسلط نسبی بر مهارت‌های خواندن، شنیدن و درک مطلب این زبان لازم است.",

        /* Testimonials */
        "testimonial_1": "نوروبیت درک من از هوش مصنوعی را دگرگون کرد و اعتمادبه‌نفسم را برای پیوستن به یک استارتاپ پیشرو بالا برد.",
        "testimonial_2": "ترکیب عمق فنی و منتورینگ مهارت‌های نرم در نوروبیت بی‌نظیر است؛ دو هفته بعد از فارغ‌التحصیلی اولین شغل فرانت‌اند خود را گرفتم.",
        "testimonial_3": "مرحله کارآموزی نوروبیت مرا مستقیماً درگیر پروژه‌های واقعی کرد—اکنون رهبر یک تیم کوچک در یک استارتاپ حوزه سلامت هستم.",
        "role_ai_engineer": "مهندس هوش مصنوعی @ مدریک",
        "role_frontend_dev": "توسعه‌دهنده فرانت‌اند @ دیجی‌کالا",
        "role_product_designer": "طراح محصول @ جاباما",

        /* Team */
        "team_title": "اعضای اصلی تیم",
        "role_ceo": "مدیرعامل",
        "role_cbo": "مدیر توسعه کسب‌وکار",
        "role_cto": "مدیر فناوری",
        "role_name_ceo": "علی اسماعیل زاده",
        "role_name_cbo": "عبدالله فیض الله زاده",
        "role_name_cto": "فرهاد رضاقلی",

        "ethics_title": "منشور اخلاق و محیط امن",
        "ethics_intro": "ما معتقدیم هر فراگیر شایستهٔ فضایی امن، فراگیر و الهام‌بخش برای رشد است. در نوروبیت به روش‌های زیر این محیط بدون نگرانی را برای نوجوانان و جوانان حفظ می‌کنیم:",
        "ethics_point1": "🛡️ منتورهای تأیید‌شده: همه مدرسان ما پس از بررسی پیشینه و گذراندن دوره‌ٔ حفاظت از نوجوانان انتخاب می‌شوند.",
        "ethics_point2": "🤝 سیاست عدم تحمل مطلق در برابر هرگونه زورگویی، آزار، یا تبعیض.",
        "ethics_point3": "⏱️ کلیه جلسات زنده ضبط شده و در صورت درخواست در دسترس والدین قرار می‌گیرد.",
        "ethics_point4": "🔒 اطلاعات خصوصی کاملاً محرمانه است — هیچ‌گاه داده‌ٔ دانش‎آموزان را به شخص ثالث منتقل نمی‌کنیم.",
        "ethics_point5": "📞 خط ارتباطی ویژه والدین و گزارش پیشرفت ماهانه.",

    }
};

let currentLang = "fa";
const langBtns = document.querySelectorAll(".lang-toggle");

// ---------- HERO DYNAMIC TEXT ----------
const TEXTS_EN = [
    "join in an ultra learning program",
    "connect to real world job apportunities",
    "become creative, confident and adabtable"
];
const TEXTS_FA = [
    "در برنامهٔ یادگیری فوق‌العاده شرکت کنید",
    "به فرصت‌های شغلی واقعی متصل شوید",
    "خلاق، بااعتمادبه‌نفس و سازگار شوید"
];
let TEXTS = TEXTS_EN, i = 0;

function applyTranslations() {
    document.querySelectorAll("[data-i18n]").forEach(el => {
        const key = el.getAttribute("data-i18n");
        el.innerHTML = translations[currentLang][key] || el.innerHTML;
    });
    document.documentElement.dir = currentLang === "fa" ? "rtl" : "ltr";
    langBtns.forEach(langBtn => {
        langBtn.textContent = currentLang === "fa" ? "EN" : "FA";
    });
    TEXTS = currentLang === "fa" ? TEXTS_FA : TEXTS_EN;
    document.querySelector(".lead-text").innerHTML = "";
}

langBtns.forEach(langBtn => {
    langBtn.addEventListener("click", () => {
        currentLang = currentLang === "en" ? "fa" : "en";
        applyTranslations();
    });
});


applyTranslations(); // initial
